Repository: apomalyn/portfolio
Catalog: lib/l10n/intl_*.arb
Languages: fr

# other_lang
source: FR
fr: EN

# landing_subtitle_part_1
source: Student in
fr: Étudiant en

# landing_subtitle_part_2
source: software engineering
fr: génie logiciel

# landing_scroll
source: Scroll
fr: Défiler

# github_tooltip
source: See the project of Github
fr: Voir le projet sur Github.

# link_default_tooltip
source: See the project website
fr: Voir le site du projet

source: See more
fr: Voir plus

source: See less
fr: Voir moins

# projects_title
source: My projects.
fr: Mes projets.

# project_status_in_progress
source: In progress
fr: En cours

# project_status_done
source: Done
fr: Fini

# project_etsmobile_description
source: ÉTSMobile is an application developed by and for all students of the École de Technologie Supérieure. I had the chance to participate the architecture and the fourth version of this application.
fr: ÉTSMobile est l'application développé par et pour les étudiants de l'École de Technologie Supérieure. J'ai eu la chance de participer à la quatrième version de l'application.

# project_cinet_description
source: Cinet is a project mixing hardware and software for the good of amateur cinema. The main purpose is to offer electronic probes easily controllable and customisable.
fr: Cinet est un projet mélangeant matériel et logiciel pour le bien du cinéma amateur. L'objectif est de concevoir des accessoires de cinéma électronique facilement contrôlable et personnalisable.

# project_cinet_tooltip
source: See the first probe on video!
fr: Voir le premier accessoire en image!

# project_tragile_description
source: Each pedestrian is unique, from colourblind to agoraphobic passing by deaf, blind, or have a stroller or luggage. Unfortunately, pedestrians are the most vulnerable users on the road. First prize of the HackQC 19, Tragile offers safer routes adapted to the user.
fr: Chaque piéton est unique, daltonien à agoraphobe en passant par les sourds, aveugles, parents avec une poussette ou voyageur avec valises, tous sont uniques. Malheureusement, les piétons sont les usagers de la route les plus vulnérables. Premier prix du HackQC 19, Tragile propose des trajets plus sécuritaires et adapté à l’utilisateur.

# project_tragile_tooltip
source: See the article published in the ÉTS journal.
fr: Voir l'article paru dans le journal de l'ÉTS.

# about_first_paragraph
source: I love the design process. From planning, to software architecture, to development, through team coordination, the realization of the release and the feeling of always improving the product. Curious about everything and about learning, I love travel, the adventure that accompanies it and meeting people.
fr: J’aime le processus de conception. De la planification, à l'architecture, au développement, en passant par la coordination d’équipe, la concrétisation de la mise en production et le sentiment de toujours améliorer le produit. Curieux de tout et d'apprentissage, j’aime le voyage, l’aventure qui l’accompagne et les rencontres.

# volunteer_title
source: My volunteer experiences.
fr: Mes implications.

# volunteer_dsc_details
source: I was lucky enough to be selected by Google to create a DSC chapter in my university (ÉTS), in addition to having introduce me to great people, it allowed me to learn how to prepare and present a technical talk as well as how to manage a community. I keep wonderful memories of this experience even if I think I could have done better. I've made friends and given me a goal: to help developer communities whether by giving tech talks, workshop or by participating in the organization of similar events.
fr: J'ai eu la chance d'être sélectionné par Google pour créer un chapitre de DSC dans mon université (ÉTS), en plus de m'avoir fait rencontrer des personnes formidables, cela m'a permis d'apprendre comment préparé et présenter une conférence technique ainsi que comment gérer une communauté. Je garde de cette expérience des superbes souvenirs même si je continue de penser que j'aurais pu mieux faire. Je me suis fait des amis et surtout un objectif: aider les communautés de développeurs que ce soit en donnant des conférences, des workshops ou bien en participant à l'organisation d'évènements similaires.

# volunteer_dsc_semanticsImageLabel
source: Logo of the Developer Student Club (DSC) program.
fr: Logo du programme Developer Student Club (DSC).

# volunteer_applets_title
source: President
fr: Ancien Capitaine

# volunteer_applets_details
source: App|ETS is a scientific student club focused on mobile engineering, I had the chance, among other things, to be the designer, architect and project manager of the rewrite (and adding new features) in Flutter of ÉTSMobile (v4.0). This club brought me a lot, I was able to improve my leadership, set up a organizational culture, be the intermediary between the needs of the university, those of the students and the club, but above all, it allowed me to mature as a person. This experience will have been more than memorable and I will be forever grateful to the members of this club.
fr: App|ETS est un club scientifique orienté sur l'ingénierie mobile, j'ai eu la chance, entre autre, d'être le concepteur, l'architecte et gestionnaire de projet pour la réécriture en Flutter d'ÉTSMobile (v4.0). Ce club m'a beaucoup apporté, j'ai pu améliorer mon leadership, mettre en place une culture organisationnelle, être l'intermédiaire entre les besoins de l'université, ceux des élèves (consommateurs de l'application) et le club, mais surtout cela m'a permis de mûrir en tant que personne. Cette expérience aura été plus que marquante et je serais à jamais reconnaissant envers les membres de ce club.

# volunteer_applets_semanticsImageLabel
source: Logo of the scientific club Applets (written App|ETS)
fr: Logo du club scientifique Applets (écrit App|ETS)

# journey_title
source: My journey.
fr: Mon parcours.

# journey_in_dev
source: This section is currently in development, in the meantime, to see my journey you could head off my
fr: Cette section est actuellement en développement, en attendant, pour voir mon parcours vous pouvez visiter mon

# journey_in_dev_2
source: LinkedIn profile.
fr: profil LinkedIn.

# journey_education
source: Education
fr: Éducation

# journey_experience
source: Experience
fr: Expérience

# journey_iut_title
source: DUT in computer science, France
fr: DUT en informatique, France

# journey_cegep_title
source: DEC in computer science, Matane
fr: DEC en technique de l'informatique, Matane

# journey_ets_title
source: Bachelor of Software engineering, Montréal
fr: Baccalauréat en génie logicielle, Montréal

# journey_pvp_title
source: Groupe PVP - PHP developer, Matane
fr: Groupe PVP - Développeur PHP, Matane

# journey_intact_title
source: Intact Insurance - Web developer, Montréal
fr: Intact Assurence - Développeur Web, Montréal

# journey_nbc_title
source: National Bank of Canada - SRE, Montréal
fr: Banque Nationale du Canada - SRE, Montréal

# journey_nbc_short_title
source: NBC
fr: BNC

# footer_copyright
source: © Xavier Chrétien, 2020 - All Rights Reserved
fr: © Xavier Chrétien, 2020 - Tous droits réservés

# footer_github_tooltip
source: See my Github profile.
fr: Voir mon profil Github.

# footer_linkedin_tooltip
source: See my LinkedIn profile.
fr: Voir mon profil LinkedIn.

# footer_twitter_tooltip
source: See my Twitter account.
fr: Voir mon compte Twitter.
